using Microsoft.AspNetCore.Mvc;
using Project.Application.DTOs.Contract;
using Project.Application.Features.Interfaces;
using Project.Application.Responses;
using Project.Web.Api.Extensions;
using System;

namespace Project.Web.Api.Controllers
{
    [Route("api/[controller]")]
    [ApiController]
    [UserAuthorize]
    public class ContractsController : ControllerBase
    {
        private readonly IContractService _contractService;

        public ContractsController(IContractService contractService)
        {
            _contractService = contractService;
        }

        [HttpGet("[action]")]
        [Produces(typeof(Response<string>))]
        public JsonResult GetContract(string code)
        {
            string contractDetails = "• ماده 1) طرفین سند: 1ـ1ـ فروشنده: آقای / خانم / شرکت: ...... فرزند: ...... شماره کدملی / شناسه ملی: ...... تاریخ تولد / تاریخ ثبت شرکت: ...... محل تولد / ثبت شرکت: ...... نشانی: ...... شماره تماس: ...... آدرس پست الکترونیکی: ...... 1ـ2ـ خریدار: آقای / خانم / شرکت: ...... فرزند: ...... شماره کدملی / شناسه ملی: ...... تاریخ تولد / تاریخ ثبت شرکت: ...... محل تولد / ثبت شرکت: ...... نشانی: ...... شماره تماس: ...... آدرس پست الکترونیکی: ...... • ماده 2) مورد معامله: تمامی ...... دانگ ...... دستگاه خودروی: ...... تیپ: ...... سیستم: ...... مدل سال: ...... شمسی / میلادی به شماره شاسی: ...... شماره موتور: ...... و شماره VIN: ...... به شماره پلاک انتظامی: ...... حروف الفباء ...... ایران ...... دارای بیمه¬نامه معتبر شماره: ...... شرکت بیمه: ...... مدت اعتبار باقیمانده: ..... (حروفی: ......) ماه / سال به انضمام سایر منصوبات و ملحقات ...... [ترجیحاً چندین سطر در نظر گرفته شود] که جزو توابع و متعلقات مورد معامله است. • ماده 3) مبلغ (ثمن) معامله و شرایط و نحوه پرداخت آن: با توجه به توافق طرفین ثمن کل معامله به مبلغ ...... (حروفی: ......) ریال بوده که طبق توافق فی¬مابین نیز نحوه پرداخت آن به شرح ذیل می¬باشد. 3ـ1ـ مبلغ ...... (......) ریال معادل 10 درصد ثمن کل معامله به عنوان پیش¬پرداخت بوده که همزمان با تنظیم این سند عادی به موجب ...... فقره فیش / تراکنش / چک بانکی به شماره ...... مورخ ...... بانک ...... شعبه ...... نیز در وجه فروشنده / به حساب بانکی شماره ...... بانک ...... شعبه ...... متعلق به فروشنده صادر / پرداخت گردیده است. 3ـ2ـ مبلغ ...... (......) ریال معادل 80 درصد ثمن کل معامله همزمان با تحویل مورد معامله و به موجب ...... فقره چک بانکی به شماره ...... مورخ ...... بانک ...... شعبه ...... نیز در وجه فروشنده / به حساب بانکی شماره ...... بانک ...... شعبه ...... متعلق به فروشنده صادر / پرداخت می¬گردد. 3ـ3ـ مبلغ ...... (......) ریال معادل 10 درصد ثمن کل معامله همزمان با تنظیم سند رسمی انتقال در دفتر اسناد رسمی یا وکالت بلاعزل فروش (حسب درخواست و توافق طرفین) و به موجب ...... فقره چک بانکی به شماره ...... مورخ ...... بانک ...... شعبه ...... نیز در وجه فروشنده / به حساب بانکی شماره ...... بانک ...... شعبه ...... متعلق به فروشنده صادر / پرداخت می-گردد. تبصره 1ـ عدم پرداخت هریک از مبالغ مندرج در بندهای فوق از سوی خریدار (به استثنای بند 5ـ7ـ) به هرعلتی موجب منفسخ شدن و بی¬اعتباری معامله شده و با انفساخ معامله، فروشنده نیز مجاز و مأذون بوده که مورد معامله را بدون اخذ هیچگونه مجوزی به هرشخص دیگری واگذار نماید و مراتب صرفاً باید از طریق ایمیل یا صندوق پیام به اطلاع طرف مقابل برسد. • ماده 4) تسلیم مورد معامله: 4ـ1ـ زمان تسلیم: طبق توافق فیمابین طرفین مقرر شد که مورد معامله در تاریخ ...... از سوی فروشنده صحیح و سالم به همراه تمامی متعلقات آن همراه با کارت خودرو، بیمه¬نامه معتبر و سایر مدارک همزمان با رعایت مفاد بند 3ـ 3ـ طی صورتجلسه¬ای به خریدار تسلیم و تحویل شود. 4ـ2ـ مکان تسلیم: طبق توافق فیمابین طرفین مقرر شد که مورد معامله در تاریخ فوق در محل وقوع خودرو به نشانی (استان: ...... شهرستان: ...... خیابان: ...... کوچه: ...... پلاک: ...... ساختمان: ...... طبقه: ...... واحد: ......کدپستی: ......) از سوی فروشنده صحیح و سالم طی صورتجلسه¬ای به خریدار تسلیم و تحویل شود. 4ـ3ـ در صورت تاخیر و یا تعذر (عذر داشتن) در تسلیم مورد معامله خریدار حق دارد یا معامله را فسخ نموده (ظرف 3 روز از تاریخ تسلیم) و یا آن که روزانه مبلغ ...... (حروفی: ......) ریال را به عنوان خسارت تاخیر و یا تعذر از تسلیم مورد معامله که پرداخت آن بر عهده فروشنده بوده از وی مطالبه نماید. • ماده 5) سایر شروط و تعهدات طرفین معامله: 5ـ1ـ تاریخ قطعی تنظیم سندرسمی انتقال یا اعطای وکالت بلاعزل فروش در دفتر اسنادرسمی شماره ...... شهر ......  به تاریخ ...... (حروفی: ......) بوده که طرفین ملزم به حضور در آن دفترخانه جهت ایفای کلیه تعهدات مندرج در این سند و انجام تشریفات قانونی نقل و انتقال و قبل از آن حضور در مراکز تعویض پلاک موردنظر می¬باشند. 5ـ2ـ فروشنده موظف است قبل از تاریخ تنظیم سندرسمی انتقال قطعی، راساً و یا با اعطای وکالت تعویض پلاک یا وکالت فروش و انتقال (حسب مورد) به خریدار کلیه اسناد و مدارک لازم اعم از استعلامات و پاسخ استعلامات و مفاصاحساب¬های مالیاتی، عوارض شهرداری و غیره را اخذ و سپس به دفترخانه تسلیم نماید به طوری که پس از فک پلاک قبلی و اخذ پلاک جدید به نام خریدار نیز در روز تنظیم سندرسمی انتقال قطعی هیچگونه مانعی برای ثبت رسمی معامله (سند قطعی انتقال یا وکالت بلاعزل فروش) وجود نداشته باشد. 5ـ3ـ عدم حضور فیزیکی هریک از طرفین در دفتر اسنادرسمی و یا عدم آمادگی هریک برای امضاء سند اعم از وجود هرگونه مانع نظیر بازداشت یا رهن مورد معامله، فک پلاک نکردن آن، مسدودی حساب و یا آماده نبودن ثمن معامله حتی در قالب صدور چک بلامحل و غیره به طرف مقابل این حق را می¬دهد که حسب مورد گواهی عدم انجام معامله یا عدم حضور و یا حتی گواهی اعلام مراتب حضور خود در دفترخانه را جهت استیفای حقوق خویش تقاضا و اخذ نماید. 5ـ4ـ چنانچه کاشف به عمل آید که مورد معامله مستحق¬للغیر بوده و یا در رهن و بازداشت بوده و این مانع قابل مرتفع بودن نباشد فروشنده مکلف است علاوه بر استرداد تمامی ثمن معامله که من غیرحق دریافت کرده از عهده تمامی خسارات وارده به خریدار تحت هر اسم و عنوان و به هر مبلغ و میزان برآید. 5ـ5ـ با توجه به الزام طرفین به رعایت مفاد سند و ایفای تعهدات ناشی از قرارداد چنانچه این عدم وفای به عهد از سوی فروشنده باشد (به استثنای مورد بند 5ـ4ـ) نظیر تاخیر در تنظیم سند، روزانه مبلغ ...... (حروفی: ......) ریال به عنوان خسارت تاخیر و یا تعذر از تنظیم سند بر عهده فروشنده بوده که از سوی خریدار قابل مطالبه خواهد بود. 5ـ6ـ با توجه به الزام طرفین به رعایت مفاد سند و ایفای تعهدات ناشی از قرارداد چنانچه این عدم وفای به عهد از سوی خریدار باشد نظیر تاخیر در تنظیم سند و یا عدم پرداخت ثمن یا تاخیر در آن (موضوع ماده 3 و بندها و تبصره ذیل آن)، معامله خود به خود منفسخ شده و با انفساخ معامله، فروشنده مستحق تمامی مبالغ دریافتی اعم از پیش¬پرداخت و یا سایر مبالغ پرداختی به عنوان وجه التزام است و می¬تواند مورد معامله را بدون اخذ هیچگونه مجوزی به هرشخص دیگری واگذار نماید و ثمن معامله از سوی خریدار قابل مطالبه نخواهد بود. 5ـ7ـ لیکن در خصوص بند قبلی چنانچه این عدم ایفای تعهدات خریدار مربوط به مرحله تنظیم سند رسمی (10 درصد پایانی) بوده و مورد معامله به تصرف وی درآمده باشد، روزانه مبلغ ...... (حروفی: ......) ریال به عنوان خسارت تاخیر تادیه و یا تعذر از تنظیم سند (همانند بند 4ـ3ـ) بر عهده خریدار بوده که علاوه بر باقیمانده ثمن معامله از سوی فروشنده قابل مطالبه خواهد بود. 5ـ8ـ طبق توافق طرفین، فروشنده مکلف به تنظیم سند رسمی انتقال به نام خریدار و یا شخص ثالثی است که به صورت مکتوب به فروشنده باید اعلام گردد لیکن این انتقال به غیر نافی تعهدات خریدار و یا شخص ثالث به عنوان قائم¬مقام قانونی خریدار نبوده و هرگونه اختلاف احتمالی فیمابین خریدار و منتقل¬الیه (شخص ثالث) ارتباطی به حقوق و مطالبات فروشنده ندارد. در غیر این صورت (عدم رفع اختلافات احتمالی)، فروشنده متعهد به تنظیم سند رسمی انتقال به نام خریدار است. 5ـ9ـ تمامی هزینه¬های مترتب بر اخذ مفاصاحسابها، استعلامات و پاسخ آنها، پرداخت حقوق و دیون دولتی و هزینه¬های رفع بازداشت و فک رهن احتمالی بر عهده فروشنده بوده و هزینه¬های مربوط به تنظیم سند رسمی انتقال و یا وکالت (فروش یا تعویض پلاک) در دفتر اسناد رسمی و حقوق دولتی مترتب بر تنظیم سند رسمی به ترتیب (1ـ بالمناصفه بر عهده طرفین و 2ـ بر عهده فروشنده) است. 5ـ10ـ وقوع حوادث قهری و یا فورس ماژور نظیر جنگ، سیل، زلزله، بیماری¬های واگیردار از قبیل کرونا و یا هر آنچه که عرفاً در حکم قوه قاهره بوده و از حیطه اراده و اختیارات طرفین خارج است لذا در صورت اثبات این که عدم ایفای تعهدات هریک از طرفین منتسب به این قوای قهری است، شخص نامبرده در برابر طرف مقابل فاقد مسئولیت بوده و برای دیگری ایجاد حق جهت مطالبه¬گری نخواهد کرد. 5ـ11ـ تعدیل و نوسانات قیمت چه کاهنده چه فزاینده بنا به هر علتی اعم از کاهش یا افزایش عرضه و تقاضا، وقوع حوادث قهریه، توقف واردات، تولید و غیره تاثیری در ثمن معامله نداشته و تعهدات طرفین در رابطه با ثمن معامله و قیمت مورد معامله غیرقابل بحث و غیرمسموع است. 5ـ12ـ با تنظیم و امضای این سند عادی ایجاب و قبول فیمابین طرفین منعقد شده و طرفین و قائم¬مقام قانونی آنها وفق مواد 10 و 190 و 219 قانون مدنی و سایر الزامات قانونی و تعهدات قراردادی، مکلف به اجرای مفاد آن خواهند بود. • ماده 6) حق فسخ معامله: تمامی خیارات خصوصاً خیار غبن و سایر خیارات مختص عقد بیع از طرفین ساقط شد به استثنای خیار شرط مندرج در بند 4ـ3ـ و خیار تدلیس که در صورت اثبات تدلیس در مراجع قضایی ذیصلاح نیز قابلیت استفاده برای ذیحق متصور بوده و حق فسخ معامله برای وی یا وراث آنها وجود دارد. • ماده 7) زمان و مکان تنظیم سند: 7ـ1ـ زمان تنظیم عبارتست از: روز: ...... مورخ: ...... ساعت: ...... که به تایید کارشناس مربوطه رسیده و برای طرفین نیز لازم¬الاتباع است. 7ـ2ـ مکان تنظیم عبارتست از: محل وقوع خودرو به نشانی استان: ...... شهرستان: ...... که به تایید کارشناس مربوطه رسیده و برای طرفین نیز لازم¬الاتباع است. • ماده 8) قوانین حاکم بر این سند عادی: مفاد و مندرجات این سند عادی از هر حیث حتی در مقام تفسیر قصد و اراده طرفین، تعهدات طرفین و غیره تابع تمامی قوانین و مقررات جمهوری اسلامی ایران علی¬الخصوص قانون مدنی، قانون تجارت الکترونیکی، سایر موازین حقوقی و قواعد فقهی و همچنین تابع عرف محل وقوع ملک بوده و برای هریک از طرفین لازم¬الاجراست و فرض جهل به قانون مسموع نخواهد بود. • ماده 9) مرجع حل اختلاف: در صورت بروز هرگونه اختلاف و یا طرح هرگونه دعوا، ادعا، اعتراض و یا استیفای حقوق قانونی و قراردادی طبق بند 7ـ2ـ این قرارداد، محاکم و مراجع قضایی استان: ...... شهرستان: ...... صالح به رسیدگی بوده و برای طرفین لازم¬الاتباع است. • ماده 10) اعتبار امضاء (صحت امضاء) و مستند اعتبار آن: 10ـ1ـ با عنایت به طی نمودن مراحل صحت سنجی و النهایه ارسال کد به سامانه ثنای طرفین، رویت کد ارسالی به سامانه ثنا و درج آن در فرآیند تنظیم این سند، این سلسه اقدامات به منزله امضاِ الکترونیکی و منحصر به فرد طرفین تلقی شده و برابر قواعد قانون تجارت الکترونیکی ضمان¬آور و لازم¬الاجراست مگر در صورت اثبات هرگونه تدلیس احتمالی و یا تقلب و سایر عناوین مجرمانه که برای طرف مقابل (مدعی) و مدیریت این سامانه حق پیگیری کیفری و تعقیب جزایی و یا حقوقی حسب مورد متصور است و طرفین اقرار به پذیرش این امر دارند. • ماده 11) سایر ملاحظات تکمیلی: 11ـ1ـ این سند الکترونیکی عادی جهت ارائه به ...... تنظیم شده است. 11ـ2ـ هرگونه حقوق و دیون دولتی احتمالی مترتب بر مفاد این سند عادی اعم از هرگونه مالیات ، عوارض ، بدهی تامین اجتماعی ، هزینه های اجرایی و ثبتی ، صنوف و اتحادیه ها ، مطالبات اشخاص ثالث حقوقی تحت نظارت حاکمیت و غیره به عهده ...... است. **علائم و هشدارها و اطلاعات لازم (موضوع ماده 33 قانون تجارت الکترونیکی): الف) مشخصات فنی و ویژگی های کاربردی کالا یا خدمات: ب) قواعد حقوقی حمایت از حقوق مصرف کننده وفق ماده 42 قانون مذکور شامل این موارد نخواهد شد: 1ـ فهرست خدمات مالی آیین نامه اجرایی موضوع ماده 79 ق.ت.ا. 2ـ معاملات راجع به فروش اموال غیرمنقول و یا حقوق مالکیت ناشی از اموال غیر منقول (به جز اجاره اموال غیرمنقول). 3ـ خرید از ماشین های فروش مستقیم کالا و خدمات. 4ـ انجام معاملات از طریق تلفن عمومی (همگانی). 5ـ معاملات راجع به حراجی ها. ج) سایر موارد لازم به ذکر  ..... [ترجیحاً یکی دو صفحه در نظر گرفته شود] *تذکر: 1ـ مفاد این سند الکترونیکی عادی (داده پیام) فقط نسبت به طرفین و قائم مقام قانونی آنها لازم الاجرا است. 2ـ این سند برابر قانون جمهوری اسلامی ایران تابع آثار و احکام جاری بر اسناد عادی (غیررسمی) و اسناد موضوع قانون تجارت الکترنیکی می¬باشد. 3ـ صحت مفاد و مندرجات این سند الکترونیکی عادی (داده پیام) از طریق لینک سامانه به آدرس ...... قابل بررسی و صحت سنجی است. 4ـ در صورت درخواست کتبی مراجع قضایی ، انتظامی ، امنیتی ذیصلاح (حتی پلیس فتا) نیز این سند وفق مقررات در اختیار آنها قرار خواهد گرفت. 5ـ این سند الکترونیکی عادی طی ... ماده ؛ ... بند ؛ ... تبصره و در 3 نسخه که هریک در حکم واحد است فی¬مابین نامبردگان فوق \"با کد رهگیری نهایی ......\" تنظیم، امضاء و مبادله شد که قابلیت چاپ گرفتن و استناد به مفاد و مندرجات آن به تایید طرفین رسیده است.";

            return new Response<string>(contractDetails).ToJsonResult();
        }

        [HttpPost("[action]")]
        [Produces(typeof(Response<ContractDTO>))]
        public async Task<JsonResult> CreateContract([FromBody] CreateContract input)
        {
            var result = await _contractService.CreateContract(input);

            return new Response<ContractDTO>(result).ToJsonResult();
        }

        [HttpGet("[action]")]
        [Produces(typeof(Response<ContractDTO>))]
        public async Task<JsonResult> GetMyContract(int bargainCode)
        {
            var result = await _contractService.GetMyContract(bargainCode);

            return new Response<ContractDTO>(result).ToJsonResult();
        }

        [HttpGet("[action]")]
        [Produces(typeof(Response<string>))]
        public async Task<JsonResult> GetMyContractHtml(int bargainCode)
        {
            var result = await _contractService.GetMyContractHtml(bargainCode);

            return new Response<string>(result).ToJsonResult();
        }

        [HttpPost("[action]")]
        [Produces(typeof(Response<ContractDTO>))]
        public async Task<JsonResult> EditContract([FromBody] EditContract input)
        {
            var result = await _contractService.EditContract(input);

            return new Response<ContractDTO>(result).ToJsonResult();
        }

        [HttpPost("[action]")]
        [Produces(typeof(Response<ContractDTO>))]
        public async Task<JsonResult> CompleteLevel2([FromBody] ContractLevel2 input)
        {
            var result = await _contractService.CompleteLevel2(input);

            return new Response<ContractDTO>(result).ToJsonResult();
        }

        [HttpPost("[action]")]
        [Produces(typeof(Response<ContractDTO>))]
        public async Task<JsonResult> CompleteLevel3([FromBody] ContractLevel3 input)
        {
            var result = await _contractService.CompleteLevel3(input);

            return new Response<ContractDTO>(result).ToJsonResult();
        }

        [HttpPost("[action]")]
        [Produces(typeof(Response<ContractDTO>))]
        public async Task<JsonResult> CompleteLevel4([FromBody] ContractLevel4 input)
        {
            var result = await _contractService.CompleteLevel4(input);

            return new Response<ContractDTO>(result).ToJsonResult();
        }

        [HttpPost("[action]")]
        [Produces(typeof(Response<ContractDTO>))]
        public async Task<JsonResult> CompleteLevel5([FromBody] ContractLevel5 input)
        {
            var result = await _contractService.CompleteLevel5(input);

            return new Response<ContractDTO>(result).ToJsonResult();
        }

        [HttpPost("[action]")]
        [Produces(typeof(Response<ContractDTO>))]
        public async Task<JsonResult> CompleteLevel6([FromBody] ContractLevel6 input)
        {
            var result = await _contractService.CompleteLevel6(input);

            return new Response<ContractDTO>(result).ToJsonResult();
        }

        [HttpPost("[action]")]
        [Produces(typeof(Response<ContractDTO>))]
        public async Task<JsonResult> CompleteLevel7([FromBody] ContractLevel7 input)
        {
            var result = await _contractService.CompleteLevel7(input);

            return new Response<ContractDTO>(result).ToJsonResult();
        }

        [HttpPost("[action]")]
        [Produces(typeof(Response<ContractDTO>))]
        public async Task<JsonResult> CompleteLevel8([FromBody] ContractLevel8 input)
        {
            var result = await _contractService.CompleteLevel8(input);

            return new Response<ContractDTO>(result).ToJsonResult();
        }

        [HttpPost("[action]")]
        [Produces(typeof(Response<ContractDTO>))]
        public async Task<JsonResult> CompleteLevel9([FromBody] ContractLevel9 input)
        {
            var result = await _contractService.CompleteLevel9(input);

            return new Response<ContractDTO>(result).ToJsonResult();
        }

        [HttpPost("[action]")]
        [Produces(typeof(Response<ContractDTO>))]
        public async Task<JsonResult> CompleteLevel10([FromBody] ContractLevel10 input)
        {
            var result = await _contractService.CompleteLevel10(input);

            return new Response<ContractDTO>(result).ToJsonResult();
        }

        [HttpPost("[action]")]
        [Produces(typeof(Response<ContractDTO>))]
        public async Task<JsonResult> CompleteLevel11([FromBody] ContractLevel11 input)
        {
            var result = await _contractService.CompleteLevel11(input);

            return new Response<ContractDTO>(result).ToJsonResult();
        }
    }
}